points = 1
points = 2          #შევქმენი ცვლადი,შემდეგ განვაახლე და ბოლოს დავბეჭდე
points = 3
points = 4
print(points)

#გაასწორეთ შემდეგი კოდი:
    #  1age == 156 - ცვლადს არ ჭირდება ორი ტოლობის ნიშანი
    #  print(("1age) - არ ჭირდება ( და "

num1 = 4 
num2 = 5           #შევქმენი ორი ცვლადი
print(num1 + num2)
print(num1 - num2)
print(num1 // num2)    #ჩავატარე მათემატიკურუ ოპერაციები
print(num1 * num2)

#შეცდომით:
111 = 12
#print(((123)   #დავწერე არასწორი კოდი

#სწორი:
111 = 12
print(111)    #გავასწპრე შეცდომა