# 1. ინიციალიზაცია 
# __init__ მეთოდი გამოიძახება ობიექტის შექმნის დროს.


# 2. კლასის ცვლადები
# გაზიარებულია კლასის ყველა ეგზემპლარს შორის.


# 3. ეგზემპლარის მეთოდები
# მეთოდები, რომლებიც მუშაობენ კლასის ეგზემპლარზე.პირველი პარამეტრი არის self.


# 4. Inheritance
# ერთი კლასი (შვილობილი) იღებს მეორე კლასის (მშობელი) ატრიბუტებსა და მეთოდებს.


# 5. Multiple Inheritance
# კლასი იღებს მემკვიდრეობას რამდენიმე მშობელი კლასიდან.


# 6. Multilevel Inheritance
# კლასი მემკვიდრეობით ღებულობს სხვა შვილობილი კლასისგან.


# 7. super() ფუნქცია
# გამოიძახება მშობელი კლასის მეთოდები შვილობილში.


# 8. აბსტრაქტული კლასები.
# კლასები, რომლებიც არ შეიძლება ინსტანცირება (მხოლოდ მემკვიდრეობისთვის).


# 9. Polymorphism
# ერთი და იგივე მეთოდის განსხვავებული იმპლემენტაცია სხვადასხვა კლასებში.




# 10. Duck Typing
# პრინციპი: "თუ რაღაც დგება იხვივით და ყეფს ძაღლივით, მაშინ ის არის იხვი-ძაღლი"



# 11. აგრეგაცია 
# ობიექტების შეგროვება, სადაც ნაწილები შეიძლება არსებობდნენ დამოუკიდებლად.



# 12. Composition
# ობიექტების მჭიდრო დამოკიდებულება, სადაც ნაწილები ვერ არსებობენ მთავარი ობიექტის გარეშე.



# 13. Static Methods
# მეთოდები, რომლებიც არ არიან დამოკიდებული კლასის ინსტანციაზე.


# 14. Class Methods
# მეთოდები, რომლებიც მუშაობენ კლასზე (არა ინსტანციაზე).


# 15. Data Hiding
# ატრიბუტების დაცვა პირდაპირი წვდომისგან.